In [31]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (75.1.0)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [32]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [33]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [70]:
#Please find complete external url/password in pdf report
%%sql
postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db

# **CREATE TABLES**

In [35]:
%%sql
-- Table: Branch
CREATE TABLE Branch (
    Branch_ID SERIAL PRIMARY KEY,
    Name VARCHAR(100) NOT NULL,
    Address VARCHAR(255) NOT NULL,
    Phone VARCHAR(20),
    Manager VARCHAR(100)
);

-- Table: Car
CREATE TABLE Car (
    Car_ID SERIAL PRIMARY KEY,
    Branch_ID INT NOT NULL,
    Make VARCHAR(100) NOT NULL,
    Model VARCHAR(100) NOT NULL,
    Year INT NOT NULL,
    Price NUMERIC(10, 2) NOT NULL,
    Status VARCHAR(50) NOT NULL CHECK (Status IN ('New', 'Used', 'Sold')),
    VIN VARCHAR(17) UNIQUE NOT NULL,
    FOREIGN KEY (Branch_ID) REFERENCES Branch(Branch_ID)
);

-- Table: Customer
CREATE TABLE Customer (
    Customer_ID SERIAL PRIMARY KEY,
    Name VARCHAR(100) NOT NULL,
    Email VARCHAR(100),
    Phone VARCHAR(20),
    Address VARCHAR(255)
);

-- Table: Employee
CREATE TABLE Employee (
    Employee_ID SERIAL PRIMARY KEY,
    Branch_ID INT NOT NULL,
    Name VARCHAR(100) NOT NULL,
    Role VARCHAR(50) NOT NULL,
    Phone VARCHAR(20),
    Salary NUMERIC(10, 2),
    FOREIGN KEY (Branch_ID) REFERENCES Branch(Branch_ID)
);

-- Table: Sales
CREATE TABLE Sales (
    Sale_ID SERIAL PRIMARY KEY,
    Car_ID INT NOT NULL,
    Customer_ID INT NOT NULL,
    Employee_ID INT NOT NULL,
    Sale_Date TIMESTAMP NOT NULL,
    Sale_Amount NUMERIC(10, 2) NOT NULL,
    Financing_Option BOOLEAN NOT NULL,
    FOREIGN KEY (Car_ID) REFERENCES Car(Car_ID),
    FOREIGN KEY (Customer_ID) REFERENCES Customer(Customer_ID),
    FOREIGN KEY (Employee_ID) REFERENCES Employee(Employee_ID)
);

-- Table: Service
CREATE TABLE Service (
    Service_ID SERIAL PRIMARY KEY,
    Car_ID INT NOT NULL,
    Customer_ID INT NOT NULL,
    Employee_ID INT NOT NULL,
    Service_Date TIMESTAMP NOT NULL,
    Service_Type VARCHAR(100) NOT NULL,
    Service_Cost NUMERIC(10, 2),
    Service_Notes TEXT,
    FOREIGN KEY (Car_ID) REFERENCES Car(Car_ID),
    FOREIGN KEY (Customer_ID) REFERENCES Customer(Customer_ID),
    FOREIGN KEY (Employee_ID) REFERENCES Employee(Employee_ID)
);

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
Done.
Done.
Done.
Done.
Done.
Done.

[]

# **CREATE FUNCTIONS**

In [60]:
%%sql
-- Procedure: AddBranch
CREATE OR REPLACE FUNCTION AddBranch(
    branchName VARCHAR,
    branchAddress VARCHAR,
    branchPhone VARCHAR,
    branchManager VARCHAR
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Branch (Name, Address, Phone, Manager)
    VALUES (branchName, branchAddress, branchPhone, branchManager);
END;
$$ LANGUAGE plpgsql;

-- Procedure: UpdateBranch
CREATE OR REPLACE FUNCTION UpdateBranch(
    branchID INT,
    branchName VARCHAR,
    branchAddress VARCHAR,
    branchPhone VARCHAR,
    branchManager VARCHAR
) RETURNS VOID AS $$
BEGIN
    UPDATE Branch
    SET Name = branchName, Address = branchAddress, Phone = branchPhone, Manager = branchManager
    WHERE Branch_ID = branchID;
END;
$$ LANGUAGE plpgsql;

-- Procedure: AddCar
CREATE OR REPLACE FUNCTION AddCar(
    branchID INT,
    make VARCHAR,
    model VARCHAR,
    year INT,
    price DECIMAL,
    status VARCHAR,
    vin VARCHAR
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Car (Branch_ID, Make, Model, Year, Price, Status, VIN)
    VALUES (branchID, make, model, year, price, status, vin);
END;
$$ LANGUAGE plpgsql;

-- Procedure: UpdateCarStatus
CREATE OR REPLACE FUNCTION UpdateCarStatus(
    carID INT,
    newStatus VARCHAR
) RETURNS VOID AS $$
BEGIN
    UPDATE Car
    SET Status = newStatus
    WHERE Car_ID = carID;
END;
$$ LANGUAGE plpgsql;

-- Procedure: RecordSale
CREATE OR REPLACE FUNCTION RecordSale(
    carID INT,
    customerID INT,
    employeeID INT,
    saleDate TIMESTAMP,
    saleAmount DECIMAL,
    financingOption BOOLEAN
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Sales (Car_ID, Customer_ID, Employee_ID, Sale_Date, Sale_Amount, Financing_Option)
    VALUES (carID, customerID, employeeID, saleDate, saleAmount, financingOption);

    UPDATE Car
    SET Status = 'Sold'
    WHERE Car_ID = carID;
END;
$$ LANGUAGE plpgsql;

-- Procedure: AddCustomer
CREATE OR REPLACE FUNCTION AddCustomer(
    customerName VARCHAR,
    customerEmail VARCHAR,
    customerPhone VARCHAR,
    customerAddress VARCHAR
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Customer (Name, Email, Phone, Address)
    VALUES (customerName, customerEmail, customerPhone, customerAddress);
END;
$$ LANGUAGE plpgsql;

-- Procedure: UpdateCustomer
CREATE OR REPLACE FUNCTION UpdateCustomer(
    customerID INT,
    customerName VARCHAR,
    customerEmail VARCHAR,
    customerPhone VARCHAR,
    customerAddress VARCHAR
) RETURNS VOID AS $$
BEGIN
    UPDATE Customer
    SET Name = customerName, Email = customerEmail, Phone = customerPhone, Address = customerAddress
    WHERE Customer_ID = customerID;
END;
$$ LANGUAGE plpgsql;

-- Procedure: ScheduleService
CREATE OR REPLACE FUNCTION ScheduleService(
    carID INT,
    customerID INT,
    employeeID INT,
    serviceDate TIMESTAMP,
    serviceType VARCHAR,
    serviceCost DECIMAL,
    serviceNotes TEXT
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Service (Car_ID, Customer_ID, Employee_ID, Service_Date, Service_Type, Service_Cost, Service_Notes)
    VALUES (carID, customerID, employeeID, serviceDate, serviceType, serviceCost, serviceNotes);
END;
$$ LANGUAGE plpgsql;

-- Procedure: AddEmployee
CREATE OR REPLACE FUNCTION AddEmployee(
    branchID INT,
    employeeName VARCHAR,
    role VARCHAR,
    phone VARCHAR,
    salary DECIMAL
) RETURNS VOID AS $$
BEGIN
    INSERT INTO Employee (Branch_ID, Name, Role, Phone, Salary)
    VALUES (branchID, employeeName, role, phone, salary);
END;
$$ LANGUAGE plpgsql;

-- Procedure: UpdateEmployee
CREATE OR REPLACE FUNCTION UpdateEmployee(
    employeeID INT,
    branchID INT,
    employeeName VARCHAR,
    employeeRole VARCHAR,
    employeePhone VARCHAR,
    employeeSalary DECIMAL
) RETURNS VOID AS $$
BEGIN
    UPDATE Employee
    SET Branch_ID = branchID, Name = employeeName, Role = employeeRole, Phone = employeePhone, Salary = employeeSalary
    WHERE Employee_ID = employeeID;
END;
$$ LANGUAGE plpgsql;

-- Procedure: GetBranches
CREATE OR REPLACE FUNCTION GetBranches()
RETURNS TABLE(Branch_ID INT, Name VARCHAR, Address VARCHAR, Phone VARCHAR, Manager VARCHAR) AS $$
BEGIN
    RETURN QUERY
    SELECT Branch.Branch_ID, Branch.Name, Branch.Address, Branch.Phone, Branch.Manager
    FROM Branch;
END;
$$ LANGUAGE plpgsql;


-- Procedure: GetSales
CREATE OR REPLACE FUNCTION GetSales()
RETURNS TABLE(Sale_ID INT, Car_ID INT, Customer_ID INT, Employee_ID INT, Sale_Date TIMESTAMP, Sale_Amount DECIMAL, Financing_Option BOOLEAN) AS $$
BEGIN
    RETURN QUERY
    SELECT Sales.Sale_ID, Sales.Car_ID, Sales.Customer_ID, Sales.Employee_ID, Sales.Sale_Date, Sales.Sale_Amount, Sales.Financing_Option
    FROM Sales;
END;
$$ LANGUAGE plpgsql;


-- Procedure: GetCars
CREATE OR REPLACE FUNCTION GetCars()
RETURNS TABLE(Car_ID INT, Branch_ID INT, Make VARCHAR, Model VARCHAR, Year INT, Price DECIMAL, Status VARCHAR, VIN VARCHAR) AS $$
BEGIN
    RETURN QUERY
    SELECT Car.Car_ID, Car.Branch_ID, Car.Make, Car.Model, Car.Year, Car.Price, Car.Status, Car.VIN
    FROM Car;
END;
$$ LANGUAGE plpgsql;


-- Procedure: GetCustomers
CREATE OR REPLACE FUNCTION GetCustomers()
RETURNS TABLE(Customer_ID INT, Name VARCHAR, Email VARCHAR, Phone VARCHAR, Address VARCHAR) AS $$
BEGIN
    RETURN QUERY
    SELECT Customer.Customer_ID, Customer.Name, Customer.Email, Customer.Phone, Customer.Address
    FROM Customer;
END;
$$ LANGUAGE plpgsql;


-- Procedure: GetServiceSchedules
CREATE OR REPLACE FUNCTION GetServiceSchedules()
RETURNS TABLE(Service_ID INT, Car_ID INT, Customer_ID INT, Employee_ID INT, Service_Date TIMESTAMP, Service_Type VARCHAR, Service_Cost DECIMAL, Service_Notes TEXT) AS $$
BEGIN
    RETURN QUERY
    SELECT Service.Service_ID, Service.Car_ID, Service.Customer_ID, Service.Employee_ID, Service.Service_Date, Service.Service_Type, Service.Service_Cost, Service.Service_Notes
    FROM Service;
END;
$$ LANGUAGE plpgsql;


-- Procedure: GetEmployees
CREATE OR REPLACE FUNCTION GetEmployees()
RETURNS TABLE(Employee_ID INT, Branch_ID INT, Name VARCHAR, Role VARCHAR, Phone VARCHAR, Salary DECIMAL) AS $$
BEGIN
    RETURN QUERY
    SELECT Employee.Employee_ID, Employee.Branch_ID, Employee.Name, Employee.Role, Employee.Phone, Employee.Salary
    FROM Employee;
END;
$$ LANGUAGE plpgsql;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# **INSERT SAMPLE/DUMMY DATA**

In [39]:
%%sql
INSERT INTO Branch (Name, Address, Phone, Manager)
VALUES
    ('Downtown Motors', '123 Main St, Cityville', '123-456-7890', 'Alice Johnson'),
    ('Uptown Autos', '456 Elm St, Cityville', '123-555-1234', 'Bob Smith'),
    ('Suburban Cars', '789 Oak St, Suburbia', '123-444-5678', 'Carol Davis');


INSERT INTO Car (Branch_ID, Make, Model, Year, Price, Status, VIN)
VALUES
    (1, 'Hyundai', 'Elantra', 2023, 21000.00, 'New', '5NPDH4AE5DH123456'),
    (1, 'Kia', 'Sorento', 2020, 26000.00, 'Used', 'KNAPC81CDHA123456'),
    (1, 'Mazda', 'CX-5', 2022, 28000.00, 'New', 'JM3KFBCM4K0123456'),
    (2, 'BMW', 'X5', 2019, 45000.00, 'Used', '5UXKR0C52H0U12345'),
    (2, 'Mercedes-Benz', 'C-Class', 2021, 55000.00, 'New', 'WDDWJ8DB8JF123456'),
    (2, 'Audi', 'Q5', 2020, 40000.00, 'Used', 'WA1CNAFY8L2012345'),
    (3, 'Volkswagen', 'Jetta', 2023, 23000.00, 'New', '3VW2B7AJ4FM123456'),
    (3, 'Subaru', 'Outback', 2021, 27000.00, 'Used', '4S4BTDLC4J2123456'),
    (3, 'Dodge', 'Charger', 2022, 32000.00, 'New', '2C3CDXCT9HH123456'),
    (1, 'Chevrolet', 'Tahoe', 2021, 55000.00, 'Used', '1GNSKAKC3HR123456'),
    (2, 'Toyota', 'Camry', 2020, 24000.00, 'Used', '4T1BF1FK4FU123456'),
    (3, 'Ford', 'F-150', 2023, 60000.00, 'New', '1FTFW1EF2EK123456'),
    (2, 'Tesla', 'Model Y', 2022, 62000.00, 'New', '5YJYGDEE3LF123456'),
    (1, 'Honda', 'Accord', 2021, 25000.00, 'Used', '1HGCR2F32FA123456'),
    (3, 'Nissan', 'Rogue', 2019, 20000.00, 'Used', 'JN8AT2MV9LW123456'),
    (1, 'Toyota', 'Corolla', 2022, 20000.00, 'New', '1HGBH41JXMN109186'),
    (1, 'Honda', 'Civic', 2020, 18000.00, 'Used', '1HGCM82633A123456'),
    (2, 'Ford', 'Escape', 2021, 25000.00, 'New', '2FMPK3J94LBC12345'),
    (2, 'Tesla', 'Model 3', 2019, 35000.00, 'Used', '5YJ3E1EB5KF317678'),
    (3, 'Chevrolet', 'Malibu', 2023, 23000.00, 'New', '1G1ZD5ST5LF035678'),
    (3, 'Nissan', 'Altima', 2018, 15000.00, 'Sold', '1N4AL3AP5HC123456');

INSERT INTO Customer (Name, Email, Phone, Address)
VALUES
    ('John Doe', 'john.doe@example.com', '321-654-9870', '456 Maple St, Cityville'),
    ('Jane Smith', 'jane.smith@example.com', '987-654-3210', '789 Birch St, Suburbia'),
    ('Michael Brown', 'michael.brown@example.com', '555-789-1234', '123 Pine St, Cityville'),
    ('Sarah Connor', 'sarah.connor@example.com', '123-123-1234', '789 Future St, Skynet City'),
    ('Ethan Hunt', 'ethan.hunt@example.com', '456-456-4567', '123 Spy Lane, Mission Town'),
    ('Lara Croft', 'lara.croft@example.com', '789-789-7890', '456 Adventure Rd, Tombsville'),
    ('Bruce Wayne', 'bruce.wayne@example.com', '101-101-1010', '1007 Gotham St, Gotham City'),
    ('Clark Kent', 'clark.kent@example.com', '202-202-2020', '1938 Krypton Ave, Metropolis'),
    ('Diana Prince', 'diana.prince@example.com', '303-303-3030', '987 Themyscira Ln, Paradise Island'),
    ('Tony Stark', 'tony.stark@example.com', '404-404-4040', '3000 Iron Man Blvd, Stark Tower'),
    ('Peter Parker', 'peter.parker@example.com', '505-505-5050', '20 Ingram St, Queens'),
    ('Natasha Romanoff', 'natasha.romanoff@example.com', '606-606-6060', '108 Widow St, Red Room'),
    ('Steve Rogers', 'steve.rogers@example.com', '707-707-7070', '1941 Shield Rd, Brooklyn'),
    ('Bruce Banner', 'bruce.banner@example.com', '808-808-8080', '110 Gamma Ave, Science Town'),
    ('Thor Odinson', 'thor.odinson@example.com', '909-909-9090', '123 Asgard Way, Valhalla'),
    ('Wanda Maximoff', 'wanda.maximoff@example.com', '111-222-3333', '456 Hex Lane, Westview'),
    ('Stephen Strange', 'stephen.strange@example.com', '222-333-4444', '177A Bleecker St, New York'),
    ('Carol Danvers', 'carol.danvers@example.com', '333-444-5555', '789 Captain St, Space City');

INSERT INTO Employee (Branch_ID, Name, Role, Phone, Salary)
VALUES
    (1, 'Emily White', 'Salesperson', '111-222-3333', 50000.00),
    (1, 'David Black', 'Technician', '222-333-4444', 45000.00),
    (2, 'Susan Green', 'Salesperson', '333-444-5555', 52000.00),
    (3, 'James Blue', 'Manager', '444-555-6666', 70000.00);

INSERT INTO Sales (Car_ID, Customer_ID, Employee_ID, Sale_Date, Sale_Amount, Financing_Option)
VALUES
    (1, 1, 1, '2024-11-20 14:00:00', 20000.00, TRUE),
    (2, 2, 2, '2024-11-25 11:30:00', 18000.00, FALSE),
    (4, 3, 3, '2024-11-30 15:45:00', 34000.00, TRUE),
    (3, 4, 4, '2024-12-01 12:15:00', 25000.00, FALSE),
    (5, 5, 2, '2024-12-02 10:00:00', 23000.00, TRUE),
    (6, 6, 1, '2024-12-03 09:45:00', 15000.00, FALSE),
    (7, 7, 3, '2024-12-04 13:30:00', 45000.00, TRUE),
    (8, 8, 4, '2024-12-05 16:00:00', 27000.00, FALSE),
    (9, 9, 2, '2024-12-06 11:15:00', 32000.00, TRUE),
    (10, 10, 1, '2024-12-07 14:45:00', 55000.00, FALSE),
    (11, 11, 3, '2024-12-08 10:30:00', 24000.00, TRUE),
    (12, 12, 4, '2024-12-09 12:00:00', 60000.00, TRUE),
    (13, 13, 2, '2024-12-10 15:00:00', 62000.00, FALSE),
    (14, 14, 1, '2024-12-11 09:00:00', 25000.00, TRUE),
    (15, 15, 3, '2024-12-12 14:00:00', 20000.00, FALSE);

INSERT INTO Service (Car_ID, Customer_ID, Employee_ID, Service_Date, Service_Type, Service_Cost, Service_Notes)
VALUES
    (1, 1, 2, '2024-11-22 10:00:00', 'Oil Change', 50.00, 'Standard oil change performed.'),
    (2, 2, 4, '2024-11-23 14:00:00', 'Brake Replacement', 300.00, 'Replaced front and rear brake pads.'),
    (3, 3, 3, '2024-11-24 09:30:00', 'Battery Replacement', 150.00, 'Replaced car battery with a new one.'),
    (4, 4, 1, '2024-11-26 13:45:00', 'Tire Replacement', 400.00, 'Replaced all four tires.'),
    (5, 5, 2, '2024-11-27 15:00:00', 'Engine Diagnostic', 120.00, 'Engine diagnostic completed; no issues found.'),
    (6, 6, 4, '2024-11-28 11:00:00', 'Transmission Repair', 1000.00, 'Fixed transmission slipping issue.'),
    (7, 7, 3, '2024-11-29 16:30:00', 'AC Service', 200.00, 'Recharged AC system and replaced filter.'),
    (8, 8, 1, '2024-11-30 10:15:00', 'Suspension Repair', 800.00, 'Replaced front suspension components.'),
    (9, 9, 2, '2024-12-01 14:30:00', 'Alignment', 100.00, 'Performed wheel alignment.'),
    (10, 10, 4, '2024-12-02 12:45:00', 'Exhaust Repair', 500.00, 'Replaced damaged muffler.'),
    (11, 11, 3, '2024-12-03 09:00:00', 'Coolant Flush', 100.00, 'Replaced coolant and flushed system.'),
    (12, 12, 1, '2024-12-04 15:30:00', 'Detailing', 150.00, 'Complete interior and exterior detailing.'),
    (13, 13, 2, '2024-12-05 10:45:00', 'Headlight Restoration', 80.00, 'Restored both headlights to clear finish.'),
    (14, 14, 4, '2024-12-06 11:30:00', 'Paint Touch-Up', 250.00, 'Minor paint touch-ups on scratches.'),
    (15, 15, 3, '2024-12-07 13:00:00', 'Fuel System Cleaning', 180.00, 'Cleaned and serviced fuel injection system.');

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
3 rows affected.
21 rows affected.
18 rows affected.
4 rows affected.
15 rows affected.
15 rows affected.

[]

# **USING FUNCTIONS FOR SCREENS**

In [44]:
%%sql
-- Test AddBranch function
SELECT AddBranch('Midtown Autos', '321 Central Ave, Midtown', '123-678-1234', 'Diana Ross');

-- Verify the result
SELECT * FROM Branch WHERE Name = 'Midtown Autos';

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(4, 'Midtown Autos', '321 Central Ave, Midtown', '123-678-1234', 'Diana Ross')]

In [43]:
%%sql
-- Test UpdateBranch function
SELECT UpdateBranch(1, 'Downtown Cars', '123 Main St, New Cityville', '123-000-7890', 'Alice Cooper');

-- Verify the result
SELECT * FROM Branch WHERE Branch_ID = 1;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(1, 'Downtown Cars', '123 Main St, New Cityville', '123-000-7890', 'Alice Cooper')]

In [45]:
%%sql
-- Test AddCar function
SELECT AddCar(2, 'Toyota', 'Highlander', 2023, 35000.00, 'New', '5TDFZRBH7MS123456');

-- Verify the result
SELECT * FROM Car WHERE VIN = '5TDFZRBH7MS123456';

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(22, 2, 'Toyota', 'Highlander', 2023, Decimal('35000.00'), 'New', '5TDFZRBH7MS123456')]

In [46]:
%%sql
-- Test UpdateCarStatus function
SELECT UpdateCarStatus(1, 'Sold');

-- Verify the result
SELECT * FROM Car WHERE Car_ID = 1;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(1, 1, 'Hyundai', 'Elantra', 2023, Decimal('21000.00'), 'Sold', '5NPDH4AE5DH123456')]

In [47]:
%%sql
-- Test RecordSale function
SELECT RecordSale(7, 8, 2, '2024-12-13 10:30:00', 45000.00, TRUE);

-- Verify the result in Sales table
SELECT * FROM Sales WHERE Car_ID = 7;

-- Verify the car status update in Car table
SELECT * FROM Car WHERE Car_ID = 7;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
2 rows affected.
1 rows affected.

[(7, 3, 'Volkswagen', 'Jetta', 2023, Decimal('23000.00'), 'Sold', '3VW2B7AJ4FM123456')]

In [48]:
%%sql
-- Test AddCustomer function
SELECT AddCustomer('Sam Wilson', 'sam.wilson@example.com', '123-111-2222', '789 Hero St, Shield City');

-- Verify the result
SELECT * FROM Customer WHERE Name = 'Sam Wilson';

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(19, 'Sam Wilson', 'sam.wilson@example.com', '123-111-2222', '789 Hero St, Shield City')]

In [49]:
%%sql
-- Test UpdateCustomer function
SELECT UpdateCustomer(1, 'Johnathan Doe', 'johnathan.doe@example.com', '321-654-0000', '456 Updated St, New Cityville');

-- Verify the result
SELECT * FROM Customer WHERE Customer_ID = 1;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(1, 'Johnathan Doe', 'johnathan.doe@example.com', '321-654-0000', '456 Updated St, New Cityville')]

In [50]:
%%sql
-- Test ScheduleService function
SELECT ScheduleService(8, 6, 1, '2024-12-14 12:00:00', 'Wheel Alignment', 120.00, 'Adjusted front and rear alignment.');

-- Verify the result
SELECT * FROM Service WHERE Car_ID = 8 AND Service_Date = '2024-12-14 12:00:00';

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(16, 8, 6, 1, datetime.datetime(2024, 12, 14, 12, 0), 'Wheel Alignment', Decimal('120.00'), 'Adjusted front and rear alignment.')]

In [51]:
%%sql
-- Test AddEmployee function
SELECT AddEmployee(2, 'Clark Kent', 'Technician', '202-333-4444', 48000.00);

-- Verify the result
SELECT * FROM Employee WHERE Name = 'Clark Kent';

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(5, 2, 'Clark Kent', 'Technician', '202-333-4444', Decimal('48000.00'))]

In [61]:
%%sql
-- Test UpdateEmployee function
SELECT UpdateEmployee(1, 1, 'Emily Smith', 'Sales Manager', '111-000-3333', 55000.00);

-- Verify the result
SELECT * FROM Employee WHERE Employee_ID = 1;

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
1 rows affected.
1 rows affected.

[(1, 1, 'Emily Smith', 'Sales Manager', '111-000-3333', Decimal('55000.00'))]

In [63]:
%%sql
-- Test GetBranches function
SELECT * FROM GetBranches();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
4 rows affected.

[(2, 'Uptown Autos', '456 Elm St, Cityville', '123-555-1234', 'Bob Smith'),
 (3, 'Suburban Cars', '789 Oak St, Suburbia', '123-444-5678', 'Carol Davis'),
 (1, 'Downtown Cars', '123 Main St, New Cityville', '123-000-7890', 'Alice Cooper'),
 (4, 'Midtown Autos', '321 Central Ave, Midtown', '123-678-1234', 'Diana Ross')]

In [64]:
%%sql
-- Test GetCars function
SELECT * FROM GetCars();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
22 rows affected.

[(2, 1, 'Kia', 'Sorento', 2020, Decimal('26000.00'), 'Used', 'KNAPC81CDHA123456'),
 (3, 1, 'Mazda', 'CX-5', 2022, Decimal('28000.00'), 'New', 'JM3KFBCM4K0123456'),
 (4, 2, 'BMW', 'X5', 2019, Decimal('45000.00'), 'Used', '5UXKR0C52H0U12345'),
 (5, 2, 'Mercedes-Benz', 'C-Class', 2021, Decimal('55000.00'), 'New', 'WDDWJ8DB8JF123456'),
 (6, 2, 'Audi', 'Q5', 2020, Decimal('40000.00'), 'Used', 'WA1CNAFY8L2012345'),
 (8, 3, 'Subaru', 'Outback', 2021, Decimal('27000.00'), 'Used', '4S4BTDLC4J2123456'),
 (9, 3, 'Dodge', 'Charger', 2022, Decimal('32000.00'), 'New', '2C3CDXCT9HH123456'),
 (10, 1, 'Chevrolet', 'Tahoe', 2021, Decimal('55000.00'), 'Used', '1GNSKAKC3HR123456'),
 (11, 2, 'Toyota', 'Camry', 2020, Decimal('24000.00'), 'Used', '4T1BF1FK4FU123456'),
 (12, 3, 'Ford', 'F-150', 2023, Decimal('60000.00'), 'New', '1FTFW1EF2EK123456'),
 (13, 2, 'Tesla', 'Model Y', 2022, Decimal('62000.00'), 'New', '5YJYGDEE3LF123456'),
 (14, 1, 'Honda', 'Accord', 2021, Decimal('25000.00'), 'Used', '1HGCR2F32FA123456'),
 (15, 3, 'Nissan', 'Rogue', 2019, Decimal('20000.00'), 'Used', 'JN8AT2MV9LW123456'),
 (16, 1, 'Toyota', 'Corolla', 2022, Decimal('20000.00'), 'New', '1HGBH41JXMN109186'),
 (17, 1, 'Honda', 'Civic', 2020, Decimal('18000.00'), 'Used', '1HGCM82633A123456'),
 (18, 2, 'Ford', 'Escape', 2021, Decimal('25000.00'), 'New', '2FMPK3J94LBC12345'),
 (19, 2, 'Tesla', 'Model 3', 2019, Decimal('35000.00'), 'Used', '5YJ3E1EB5KF317678'),
 (20, 3, 'Chevrolet', 'Malibu', 2023, Decimal('23000.00'), 'New', '1G1ZD5ST5LF035678'),
 (21, 3, 'Nissan', 'Altima', 2018, Decimal('15000.00'), 'Sold', '1N4AL3AP5HC123456'),
 (22, 2, 'Toyota', 'Highlander', 2023, Decimal('35000.00'), 'New', '5TDFZRBH7MS123456'),
 (1, 1, 'Hyundai', 'Elantra', 2023, Decimal('21000.00'), 'Sold', '5NPDH4AE5DH123456'),
 (7, 3, 'Volkswagen', 'Jetta', 2023, Decimal('23000.00'), 'Sold', '3VW2B7AJ4FM123456')]

In [65]:
%%sql
-- Test GetSales function
SELECT * FROM GetSales();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
16 rows affected.

[(1, 1, 1, 1, datetime.datetime(2024, 11, 20, 14, 0), Decimal('20000.00'), True),
 (2, 2, 2, 2, datetime.datetime(2024, 11, 25, 11, 30), Decimal('18000.00'), False),
 (3, 4, 3, 3, datetime.datetime(2024, 11, 30, 15, 45), Decimal('34000.00'), True),
 (4, 3, 4, 4, datetime.datetime(2024, 12, 1, 12, 15), Decimal('25000.00'), False),
 (5, 5, 5, 2, datetime.datetime(2024, 12, 2, 10, 0), Decimal('23000.00'), True),
 (6, 6, 6, 1, datetime.datetime(2024, 12, 3, 9, 45), Decimal('15000.00'), False),
 (7, 7, 7, 3, datetime.datetime(2024, 12, 4, 13, 30), Decimal('45000.00'), True),
 (8, 8, 8, 4, datetime.datetime(2024, 12, 5, 16, 0), Decimal('27000.00'), False),
 (9, 9, 9, 2, datetime.datetime(2024, 12, 6, 11, 15), Decimal('32000.00'), True),
 (10, 10, 10, 1, datetime.datetime(2024, 12, 7, 14, 45), Decimal('55000.00'), False),
 (11, 11, 11, 3, datetime.datetime(2024, 12, 8, 10, 30), Decimal('24000.00'), True),
 (12, 12, 12, 4, datetime.datetime(2024, 12, 9, 12, 0), Decimal('60000.00'), True),
 (13, 13, 13, 2, datetime.datetime(2024, 12, 10, 15, 0), Decimal('62000.00'), False),
 (14, 14, 14, 1, datetime.datetime(2024, 12, 11, 9, 0), Decimal('25000.00'), True),
 (15, 15, 15, 3, datetime.datetime(2024, 12, 12, 14, 0), Decimal('20000.00'), False),
 (16, 7, 8, 2, datetime.datetime(2024, 12, 13, 10, 30), Decimal('45000.00'), True)]

In [66]:
%%sql
-- Test GetCustomers function
SELECT * FROM GetCustomers();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
19 rows affected.

[(2, 'Jane Smith', 'jane.smith@example.com', '987-654-3210', '789 Birch St, Suburbia'),
 (3, 'Michael Brown', 'michael.brown@example.com', '555-789-1234', '123 Pine St, Cityville'),
 (4, 'Sarah Connor', 'sarah.connor@example.com', '123-123-1234', '789 Future St, Skynet City'),
 (5, 'Ethan Hunt', 'ethan.hunt@example.com', '456-456-4567', '123 Spy Lane, Mission Town'),
 (6, 'Lara Croft', 'lara.croft@example.com', '789-789-7890', '456 Adventure Rd, Tombsville'),
 (7, 'Bruce Wayne', 'bruce.wayne@example.com', '101-101-1010', '1007 Gotham St, Gotham City'),
 (8, 'Clark Kent', 'clark.kent@example.com', '202-202-2020', '1938 Krypton Ave, Metropolis'),
 (9, 'Diana Prince', 'diana.prince@example.com', '303-303-3030', '987 Themyscira Ln, Paradise Island'),
 (10, 'Tony Stark', 'tony.stark@example.com', '404-404-4040', '3000 Iron Man Blvd, Stark Tower'),
 (11, 'Peter Parker', 'peter.parker@example.com', '505-505-5050', '20 Ingram St, Queens'),
 (12, 'Natasha Romanoff', 'natasha.romanoff@example.com', '606-606-6060', '108 Widow St, Red Room'),
 (13, 'Steve Rogers', 'steve.rogers@example.com', '707-707-7070', '1941 Shield Rd, Brooklyn'),
 (14, 'Bruce Banner', 'bruce.banner@example.com', '808-808-8080', '110 Gamma Ave, Science Town'),
 (15, 'Thor Odinson', 'thor.odinson@example.com', '909-909-9090', '123 Asgard Way, Valhalla'),
 (16, 'Wanda Maximoff', 'wanda.maximoff@example.com', '111-222-3333', '456 Hex Lane, Westview'),
 (17, 'Stephen Strange', 'stephen.strange@example.com', '222-333-4444', '177A Bleecker St, New York'),
 (18, 'Carol Danvers', 'carol.danvers@example.com', '333-444-5555', '789 Captain St, Space City'),
 (19, 'Sam Wilson', 'sam.wilson@example.com', '123-111-2222', '789 Hero St, Shield City'),
 (1, 'Johnathan Doe', 'johnathan.doe@example.com', '321-654-0000', '456 Updated St, New Cityville')]

In [67]:
%%sql
-- Test GetServiceSchedules function
SELECT * FROM GetServiceSchedules();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
16 rows affected.

[(1, 1, 1, 2, datetime.datetime(2024, 11, 22, 10, 0), 'Oil Change', Decimal('50.00'), 'Standard oil change performed.'),
 (2, 2, 2, 4, datetime.datetime(2024, 11, 23, 14, 0), 'Brake Replacement', Decimal('300.00'), 'Replaced front and rear brake pads.'),
 (3, 3, 3, 3, datetime.datetime(2024, 11, 24, 9, 30), 'Battery Replacement', Decimal('150.00'), 'Replaced car battery with a new one.'),
 (4, 4, 4, 1, datetime.datetime(2024, 11, 26, 13, 45), 'Tire Replacement', Decimal('400.00'), 'Replaced all four tires.'),
 (5, 5, 5, 2, datetime.datetime(2024, 11, 27, 15, 0), 'Engine Diagnostic', Decimal('120.00'), 'Engine diagnostic completed; no issues found.'),
 (6, 6, 6, 4, datetime.datetime(2024, 11, 28, 11, 0), 'Transmission Repair', Decimal('1000.00'), 'Fixed transmission slipping issue.'),
 (7, 7, 7, 3, datetime.datetime(2024, 11, 29, 16, 30), 'AC Service', Decimal('200.00'), 'Recharged AC system and replaced filter.'),
 (8, 8, 8, 1, datetime.datetime(2024, 11, 30, 10, 15), 'Suspension Repair', Decimal('800.00'), 'Replaced front suspension components.'),
 (9, 9, 9, 2, datetime.datetime(2024, 12, 1, 14, 30), 'Alignment', Decimal('100.00'), 'Performed wheel alignment.'),
 (10, 10, 10, 4, datetime.datetime(2024, 12, 2, 12, 45), 'Exhaust Repair', Decimal('500.00'), 'Replaced damaged muffler.'),
 (11, 11, 11, 3, datetime.datetime(2024, 12, 3, 9, 0), 'Coolant Flush', Decimal('100.00'), 'Replaced coolant and flushed system.'),
 (12, 12, 12, 1, datetime.datetime(2024, 12, 4, 15, 30), 'Detailing', Decimal('150.00'), 'Complete interior and exterior detailing.'),
 (13, 13, 13, 2, datetime.datetime(2024, 12, 5, 10, 45), 'Headlight Restoration', Decimal('80.00'), 'Restored both headlights to clear finish.'),
 (14, 14, 14, 4, datetime.datetime(2024, 12, 6, 11, 30), 'Paint Touch-Up', Decimal('250.00'), 'Minor paint touch-ups on scratches.'),
 (15, 15, 15, 3, datetime.datetime(2024, 12, 7, 13, 0), 'Fuel System Cleaning', Decimal('180.00'), 'Cleaned and serviced fuel injection system.'),
 (16, 8, 6, 1, datetime.datetime(2024, 12, 14, 12, 0), 'Wheel Alignment', Decimal('120.00'), 'Adjusted front and rear alignment.')]

In [68]:
%%sql
-- Test GetEmployees function
SELECT * FROM GetEmployees();

 * postgresql://car_dealership_pg_db_user:***@dpg-ct9g0lpu0jms73cr390g-a.singapore-postgres.render.com/car_dealership_pg_db
5 rows affected.

[(2, 1, 'David Black', 'Technician', '222-333-4444', Decimal('45000.00')),
 (3, 2, 'Susan Green', 'Salesperson', '333-444-5555', Decimal('52000.00')),
 (4, 3, 'James Blue', 'Manager', '444-555-6666', Decimal('70000.00')),
 (5, 2, 'Clark Kent', 'Technician', '202-333-4444', Decimal('48000.00')),
 (1, 1, 'Emily Smith', 'Sales Manager', '111-000-3333', Decimal('55000.00'))]